Tekla.Structures.ModuleManager.ProgramConfigurationEnum
The configuration information of the program.

Tekla.Structures.ModuleManager.ProgramConfigurationEnum.CONFIGURATION_VIEWER
The viewer configuration.

Tekla.Structures.ModuleManager.ProgramConfigurationEnum.CONFIGURATION_PRODUCTION_PLANNER
The production planner configuration.

Tekla.Structures.ModuleManager.ProgramConfigurationEnum.CONFIGURATION_DRAFTER
The drafter configuration.

Tekla.Structures.ModuleManager.ProgramConfigurationEnum.CONFIGURATION_PROJECT_MANAGEMENT
The project management configuration.

Tekla.Structures.ModuleManager.ProgramConfigurationEnum.CONFIGURATION_ENGINEERING
The construction management configuration.

Tekla.Structures.ModuleManager.ProgramConfigurationEnum.CONFIGURATION_REINFORCED_CONCRETE_DETAILING
The reinforced concrete detailing configuration.

Tekla.Structures.ModuleManager.ProgramConfigurationEnum.CONFIGURATION_PRECAST_CONCRETE_DETAILING
The precast concrete detailing configuration.

Tekla.Structures.ModuleManager.ProgramConfigurationEnum.CONFIGURATION_STEEL_DETAILING
The steel detailing configuration.

Tekla.Structures.ModuleManager.ProgramConfigurationEnum.CONFIGURATION_FULL
The full detailing configuration.

Tekla.Structures.ModuleManager.ProgramConfigurationEnum.CONFIGURATION_PRIMARY
The Primary configuration.

Tekla.Structures.ModuleManager.ProgramConfigurationEnum.CONFIGURATION_EDUCATIONAL
The educational configuration.

Tekla.Structures.ModuleManager.ProgramConfigurationEnum.CONFIGURATION_DEVELOPER
The developer configuration.

Tekla.Structures.ModuleManager.ProgramConfigurationEnum.CONFIGURATION_CONSTRUCTION_MODELING
The construction management configuration with modeling capabilities.

Tekla.Structures.ModuleManager.ProgramConfigurationEnum.CONFIGURATION_STEEL_DETAILING_LIMITED
Deprecated since 19.0  The old steel detailing limited configuration. This definition was left here to enable old macros in 19.0.

Tekla.Structures.ModuleManager.ProgramConfigurationEnum.CONFIGURATION_CONSTRUCTION_VIEWER
Deprecated since 20.0  The construction management configuration restricted to viewer mode.

Tekla.Structures.ModuleManager.ProgramConfigurationEnum.CONFIGURATION_CONSTRUCTION_MANAGEMENT
Deprecated since 20.0

Tekla.Structures.ModuleManager.ProgramConfigurationEnum.CONFIGURATION_PARTNER
The partner configuration.

Tekla.Structures.ModuleManager.ProgramConfigurationEnum.CONFIGURATION_EPM_MODELER
The EPM Modeler configuration.

Tekla.Structures.ModuleManager.ProgramConfigurationEnum.CONFIGURATION_CARBON
The subscription license Carbon.

Tekla.Structures.ModuleManager.ProgramConfigurationEnum.CONFIGURATION_GRAPHITE
The subscription license Graphite.

Tekla.Structures.ModuleManager.ProgramConfigurationEnum.CONFIGURATION_DIAMOND
The subscription license Diamond.